{
    "data": [
        {
            "id": 0,
            "country": "Traveling with Group-2",
            "locations": "Navigation:",
            "thingsTodo": [
                {
                    "id": 0,
                    "location": "- Use left and right to navigate between countries."
                },
                {
                    "id": 1,
                    "location": "- Use top and bottom to scroll between locations."
                },
                {
                    "id": 2,
                    "img_url": "https://www.lufthansa.com/content/dam/lh/images/pixels_variations/c-1003809041-7731859.jpg.transform/lh-dcep-transform-width-1440/img.jpg"
                }
            ]
        },
        {
            "id": 2,
            "country": "Iceland",
            "locations": "Northern Hemisphere and mostly in the Eastern Hemisphere.",
            "thingsTodo": [
                {
                    "id": 0,
                    "location": "Reykjavík",
                    "img_url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1c/cc/d3/39/caption.jpg?w=700&h=500&s=1",
                    "description": "The capital and largest city of Iceland"
                },
                {
                    "id": 1,
                    "location": "Akureyri",
                    "img_url": "https://www.azamara.com/sites/default/files/heros/akureyri-iceland.jpg",
                    "description": "Akureyri is known as the capital city of North Iceland"
                },
                {
                    "id": 2,
                    "location": "Akranes",
                    "img_url": "https://images.fineartamerica.com/images/artworkimages/mediumlarge/2/12-akranes-iceland-joana-kruse.jpg",
                    "description": "Akranes is nestled on the foothills of the stunning 572 meters high basalt mountain of Akrafjall, on the western coast of the country."
                },
                {
                    "id": 3,
                    "location": "Vestmannaeyjar",
                    "img_url": "https://cdn2.civitatis.com/islandia/islandia/guia/vestmannaeyjar.jpg",
                    "description": "Vestmannaeyjar, are an archipelago of 15 islands and 30 rock stacks off the South Coast of Iceland."
                },
                {
                    "id": 4,
                    "location": "Húsavík",
                    "img_url": "http://cottages.is/husavik.jpg",
                    "description": "Husavik is a charming little village in the central North of Iceland, known for its incredible whale watching and geothermal baths."
                },
                {
                    "id": 5,
                    "location": "Black Beach",
                    "img_url": "https://image.posterlounge.com/images/l/1888875.jpg",
                    "description": "The black sediment on Reynisfjara beach has been formed by boiling hot lava, from the currently dormant volcano, floating across the beach, then cooling and solidifying when hitting the cold water."
                },
                {
                    "id": 6,
                    "location": "Jokulsarlon",
                    "img_url": "https://www.icelandtours.is/wp-content/uploads/2019/10/Jokulsarlon-glacier-lagoon-1.jpg",
                    "description": "Jökulsárlón is a glacial lagoon, bordering Vatnajökull National Park in southeastern Iceland. Its still, blue waters are dotted with icebergs from the surrounding Breiðamerkurjökull Glacier, part of larger Vatnajökull Glacier. The Glacier Lagoon flows through a short waterway into the Atlantic Ocean, leaving chunks of ice on a black sand beach"
                },
                {
                    "id": 7,
                    "location": "Blue Lagoon",
                    "img_url": "https://guidetoiceland.imgix.net/298360/x/0/the-blue-lagoon-geothermal-spa-lives-up-to-its-name-boasting-beautiful-azure-waters.jpg?ar=1.91%3A1&w=1200&fit=crop",
                    "description": "The Blue Lagoon is a geothermal spa in southwestern Iceland. The spa is located in a lava field near Grindavík and in front of Mount Þorbjörn on Reykjanes Peninsula, in a location favourable for geothermal power, and is supplied by water used in the nearby Svartsengi geothermal power station"
                }
            ]
        },
        {
            "id": 3,
            "country": "Greece",
            "locations": "Greece is famous for its ancient philosophers, like Plato, Pythagoras, Socrates, and Aristotle, to name a few. It is known as the birthplace of democracy in the West; they invented the Olympic Games and theater. Ancient Greeks invented monumental temples with Greek columns.",
            "thingsTodo": [
                {
                    "id": 0,
                    "location": "Santorini",
                    "img_url": "https://s3.eu-west-2.amazonaws.com/luxurylondon.co.uk-storage-bucket-001/images/280619170518/card/santorini-greece-summer-holidays-tourism-s.jpg",
                    "description": "Santorini is a volcanic island in the Cyclades group of the Greek islands. It is located between Ios and Anafi islands. It is famous for dramatic views, stunning sunsets from Oia town, the strange white aubergine (eggplant), the town of Thira, and naturally its very own active volcano."
                },
                {
                    "id": 1,
                    "location": "Nafplio",
                    "img_url": "https://magnesiatravel.gr/files/repository/20170802104622_hbourtzi.jpg",
                    "description": " Image result for Nafplio  best known forIT IS CONSIDERED TO BE ONE OF THE MOST ROMANTIC CITIES IN GREECE. With bougainvillaeas cascading down its medieval castles, Byzantine churches, Turkish fountains and mosques and stately neoclassical buildings, Nafplio marries old-world charm with stunning architecture"
                },
                {
                    "id": 2,
                    "location": "Corfu",
                    "img_url": "https://i.ytimg.com/vi/T1yQJk-Vl0E/maxresdefault.jpg",
                    "description": "Corfu Island is best known for beautiful beaches, excellent restaurants, religious sites, culture & history, and stunning accommodations"
                },
                {
                    "id": 3,
                    "location": "Zakynthos",
                    "img_url": "https://www.urlaubstracker.de/wp-content/uploads/2022/05/griechenland-zakynthos-park-hotel-und-spa-bucht-640x290.jpeg",
                    "description": "zakynthos is the worldwide famous Navagio (Shipwreck) beach and glorified by innumerable travel guides, Zakynthos island is one of the most popular Greek islands!"
                },
                {
                    "id": 4,
                    "location": "Athens",
                    "img_url": "https://cdn.britannica.com/66/102266-050-FBDEFCA1/acropolis-city-state-Greece-Athens.jpg",
                    "description": "Athens, Modern Greek Athínai, Ancient Greek Athēnai, historic city and capital of Greece. Many of Classical civilization's intellectual and artistic ideas originated there, and the city is generally considered to be the birthplace of Western civilization."
                },
                {
                    "id": 5,
                    "location": "Skiathos",
                    "img_url": "https://travelpassionate.com/wp-content/uploads/2020/01/Lalaria-Beach-Skiathos.jpg",
                    "description": "Boasting a beautiful- packed with pine trees- natural landscape and having over 60 stunning beaches, Skiathos Greece is a paradise for nature lovers!"
                },
                {
                    "id": 6,
                    "location": "Olympia",
                    "img_url": "https://www.greeka.com/photos/discover_boxes/peloponnese/olympia/history/olympia-history-480.jpg",
                    "description": "Olympia, the birthplace of the Olympic Games is another place to visit in Greece which is carved into history."
                }
            ]
        }
    ]
}